const cn = {
    login: {
        pass: {
            title: '密码登录',
            input: [
                '请输入用户名',
                '请输入登录密码',
            ],
            btn: [
                '登录',
                '短信快捷登入'
            ],
            error: [
                '用户名不能为空',
                '密码不能为空',
                '登录失败'
            ]
        },
        sms: {
            title: '短信验证登录',
            input: [
                '请输入绑定手机号码',
                '请输入短信登录验证码'
            ],
            btn: [
                '点击获取验证码',
                '登录',
                '用户账号登入'
            ]
        },
        authCode:{
            input: [
                '请输入验证码'
            ],
            btn: [
                '验证',
            ],
            message:[
                '登陆失败，请输入验证码',
                '验证码输入错误，请重新输入',
                '请输入验证码',
                '验证成功，请登录',
                '点击获取验证码'
            ]
        },
        copyright: 'Copyright © 2018 百丽国际'
    },
    main: {
        tabs: [
            '最多同时打开',
            '个页签',
            '提示',
            '确定'
        ],
        logs:'日志',
        noVer:'无版本',
        index: '首页',
        langswitch: '语言切换',
        message:'查看历史',
        notice:'查看更多',
        unread:'未读',
        read:'已读',
        createTime:"发布日期：",
        creator:"发布人：",
        lang: [
            '简体',
            '繁体',
            '英文',
        ],
        option: [
            '全屏',
            '还原',
            '关闭其他'
        ],
        search: '菜单搜索',
        news: [
            '公告',
            '消息'
        ],
        list: [
            '个人中心',
            '修改密码',
            '设置',
            '退出',
            '更换头像'
        ],
        loginout: [
            '是否退出系统？',
            '登出提示',
            '确定',
            '取消'
        ]
    },
    user: {
        title: '个人基本信息',
        msg: '提交数据成功!',
        imgMsg:'更换头像成功',
        imgTips:'请把光标，放置图片处',
        uperror: [
            '上传头像图片只能是 JPG 格式!',
            '上传头像图片大小不能超过 2MB!'
        ],
        input: [
            '登录名',
            '用户名称',
            '手机号码',
            '邮箱',
            '头像上传'
        ],
        validate: [
            '请输入登录名',
            '请输入用户名称',
            '请输入手机号码',
            '请输入邮箱',
            '请输入正确的手机号码',
            '请输入正确格式的邮箱地址'
        ],
        btn: [
            '提交',
            '取消'
        ]
    },
    pass: {
        title: '密码修改',
        msg: '内容已变更，是否确认退出?',
        msg2: '密码修改成功!',
        input: [
            '原密码',
            '新密码',
            '确认密码'
        ],
        des: [
            '密码必须包含大小写字母、数字和符号(不能有空格字符)!',
            '请输入你要修改的密码! 两次输入的密码不一致! 密码必须包含大小写字母、数字和符号(不能有空格字符)!'
        ],
        btn: [
            '提交',
            '重置'
        ],
        validate: [
            '此项为必填项!',
            '新密码大于6位!',
            '新密码必须包含英文和数字!'
        ],
        validate2: [
            '此项为必填项!',
            '两次输入密码不一致!'
        ]
    }

}

export default cn
