const cn = require('./cn')
const merge = require('merge')
const zh = {
    login: {
        pass: {
            title: '密碼登錄',
            input: [
                '請輸入用戶名',
                '請輸入登錄密碼',
            ],
            btn: [
                '登錄',
                '短信快捷登入'
            ],
            error: [
                '用戶名不能為空',
                '密碼不能為空',
                '登錄失敗'
            ]
        },
        sms: {
            title: '短信驗證登錄',
            input: [
                '請輸入綁定手機號碼',
                '請輸入短信登錄驗證碼'
            ],
            btn: [
                '點擊獲取驗證碼',
                '登錄',
                '用戶賬號登入'
            ]
        },
        authCode:{
            input: [
                '請輸入驗證碼'
            ],
            btn: [
                '驗證',
            ],
            message:[
                '登陸失敗，請輸入驗證碼',
                '驗證碼輸入錯誤，請重新輸入',
                '請輸入驗證碼',
                '驗證成功，請登錄',
                '點擊獲取驗證碼'
            ]
        },
        copyright: 'Copyright © 2018 百麗國際'
    },
    main: {
        tabs: [
            '最多同時打開',
            '個頁簽',
            '提示',
            '確定'
        ],
        logs:'日志',
        index: '首頁',
        noVer:'無版本',
        langswitch: '語言切換',
        message:'查看曆史',
        notice:'查看更多',
        createTime:"發布日期：",
        creator:"發布人：",
        unread:'未讀',
        read:'已讀',
        lang: [
            '間體',
            '繁體',
            '英文'
        ],
        option: [
            '全屏',
            '還原',
            '關閉其他'
        ],
        search: '菜單搜索',
        news: [
            '公告',
            '消息'
        ],
        list: [
            '個人中心',
            '修改密碼',
            '設置',
            '退出',
            '更換頭像'
        ],
        loginout: [
            '是否退出系統？',
            '登出提示',
            '確定',
            '取消'
        ]
    },
    user: {
        title: '個人基本信息',
        msg: '提交數據成功!',
        imgMsg:'更換頭像成功',
        imgTips:'请把光标，放置图片处',
        uperror: [
            '上傳頭像圖片只能是 JPG 格式!',
            '上傳頭像圖片大小不能超過 2MB!'
        ],
        input: [
            '登錄名',
            '用護名稱',
            '手機號碼',
            '郵箱',
            '頭像上傳'
        ],
        validate: [
            '請輸入登錄名',
            '請輸入用護名稱',
            '請輸入手機號碼',
            '請輸入郵箱',
            '請輸入正確的手機號碼',
            '請輸入正確格式的郵箱地址'
        ],
        btn: [
            '提交',
            '取消'
        ]
    },
    pass: {
        title: '密碼修改',
        msg: '內容已變更，是否確認退出?',
        msg2: '密碼修改成功!',
        input: [
            '原密碼',
            '新密碼',
            '確認密碼'
        ],
        des: [
            '密碼必須包含大小寫字母、數字和符號(不能有空格字符)!',
            '請輸入妳要修改的密碼! 兩次輸入的密碼不壹致! 密碼必須包含大小寫字母、數字和符號(不能有空格字符)!'
        ],
        btn: [
            '提交',
            '重置'
        ],
        validate: [
            '此項為必填項!',
            '新密碼大於6位!',
            '新密碼必須包含英文和數字!'
        ],
        validate2: [
            '此項為必填項!',
            '兩次輸入密碼不壹致!'
        ]
    }
}

export default merge(zh, cn)
